app/views/schedules/new.html.erb

<%= s.label "Coach Name" %><br>
<%= s.collection_select :coach_id, Coach.all, :id, :name %><br>
---
SELECT "coaches".* FROM "coaches"