app/views/coaches/new.html.erb

<label> Diet </label><br>
<%= f.collection_select :diet_id, Diet.all, :id, :name %><br>
---
SELECT "diets".* FROM "diets"