app/controllers/coaches_controller.rb

SELECT "coaches".* FROM "coaches" WHERE "coaches"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def show
        @coach = Coach.find(params[:id])

SELECT "coaches".* FROM "coaches"
---
    def index
        @coaches = Coach.all
        @count = Coach.all.length