app/controllers/diets_controller.rb

SELECT "diets".* FROM "diets"
---
    def index
        @diets = Diet.all

SELECT "diets".* FROM "diets" WHERE "diets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @diet = Diet.find(params[:id])