app/controllers/schedules_controller.rb

    def show
        @schedule = Schedule.find(params[:id])
---
SELECT "schedules".* FROM "schedules" WHERE "schedules"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]