app/views/diets/show.html.erb


        <% @diet.recipes.each do |recipe| %>
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."diet_id" = ?  [["diet_id", 6]]